In [1]:
import pandas as pd
import numpy as np

In [10]:
file_path = "D:\\unified mentor internship\\Finanical Analytics\\New folder\\Financial Analytics data.csv"
df = pd.read_csv(file_path)
df

     S.No.             Name  Mar Cap - Crore  Sales Qtr - Crore  Unnamed: 4
0        1   Reliance Inds.        583436.72           99810.00         NaN
1        2              TCS        563709.84           30904.00         NaN
2        3        HDFC Bank        482953.59           20581.27         NaN
3        4              ITC        320985.27            9772.02         NaN
4        5          H D F C        289497.37           16840.51         NaN
..     ...              ...              ...                ...         ...
483    496  Lak. Vilas Bank          3029.57             790.17         NaN
484    497            NOCIL          3026.26             249.27         NaN
485    498    Orient Cement          3024.32             511.53         NaN
486    499  Natl.Fertilizer          3017.07            2840.75         NaN
487    500        L T Foods              NaN                NaN         NaN

[488 rows x 5 columns]

In [11]:
print("Initial Data:")
print(df.head())

Initial Data:
   S.No.            Name  Mar Cap - Crore  Sales Qtr - Crore  Unnamed: 4
0      1  Reliance Inds.        583436.72           99810.00         NaN
1      2             TCS        563709.84           30904.00         NaN
2      3       HDFC Bank        482953.59           20581.27         NaN
3      4             ITC        320985.27            9772.02         NaN
4      5         H D F C        289497.37           16840.51         NaN

In [12]:
print("\nMissing Values:")
print(df.isnull().sum())

Missing Values:
S.No.                  0
Name                   0
Mar Cap - Crore        9
Sales Qtr - Crore    123
Unnamed: 4           394
dtype: int64

In [13]:
df['Mar Cap - Crore'].fillna(df['Mar Cap - Crore'].median(), inplace=True)
df['Sales Qtr - Crore'].fillna(df['Sales Qtr - Crore'].median(), inplace=True)

print("\nMissing Values After Filling:")
print(df.isnull().sum())

Missing Values After Filling:
S.No.                  0
Name                   0
Mar Cap - Crore        0
Sales Qtr - Crore      0
Unnamed: 4           394
dtype: int64

C:\Users\HP\AppData\Local\Temp\ipykernel_11004\530292131.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Mar Cap - Crore'].fillna(df['Mar Cap - Crore'].median(), inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_11004\530292131.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Sales Qtr - Crore'].fillna(df['Sales Qtr - Crore'].median(), inplace=True)

In [14]:
df['Mar Cap - Crore'] = pd.to_numeric(df['Mar Cap - Crore'], errors='coerce')
df['Sales Qtr - Crore'] = pd.to_numeric(df['Sales Qtr - Crore'], errors='coerce')

print("\nData Types:")
print(df.dtypes)

Data Types:
S.No.                  int64
Name                  object
Mar Cap - Crore      float64
Sales Qtr - Crore    float64
Unnamed: 4           float64
dtype: object

In [15]:
df.drop_duplicates(inplace=True)

print("\nCleaned Data:")
print(df.head())

Cleaned Data:
   S.No.            Name  Mar Cap - Crore  Sales Qtr - Crore  Unnamed: 4
0      1  Reliance Inds.        583436.72           99810.00         NaN
1      2             TCS        563709.84           30904.00         NaN
2      3       HDFC Bank        482953.59           20581.27         NaN
3      4             ITC        320985.27            9772.02         NaN
4      5         H D F C        289497.37           16840.51         NaN

In [16]:
cleaned_file_path = 'C:\\datasets\\Cleaned_Financial_Analytics_data.csv'
df.to_csv(cleaned_file_path, index=False)

print(f"\nCleaned dataset saved to {cleaned_file_path}")

Cleaned dataset saved to C:\datasets\Cleaned_Financial_Analytics_data.csv